<?php

// assignment/task7.php

// 7. Триъгълник на Флойд

// Създаваме масив с желаните стойности за редове;
$nums = [5, 10, 21]; // броя на елементите в масива = броя на триъгълниците

//Обхождаме масива $nums
foreach ($nums as $key => $num) {
    $value = 1; // всеки триъгълник започва от числото 1 и ред с едно число
    // Създаваме триъгълниците спрямо зададения брой редове в масива $nums
    for($i = 1; $i <= $num; $i++) {
      // Извеждаме броя числа на ред, с едно число повече от предния ред
      for($j = 1; $j <= $i; $j++) {
        // Броя на числата в реда = номера на реда
        echo "$value ";//
        $value++;// увеличава числото с 1 при ново завъртане на цикъла
      }
      // край на реда, прехвърля нанов ред
      echo '<br />';
    }
    // след всеки триъгълник слагаме линия
    echo "<hr />"; 
}