<?php

// assignment/task4.php

// 4. Вложени цикли за извеждане на триъгълник от * (звездички) :)

// Създаваме променлива за желания брой на редовете:
$row = 5;

// Цикъл който създава редовете със звездички (*):
for ($i = 0; $i < $row; $i++) {

    // Вътрешен for цикъл за брой звезди на ред, 
    // броя на звездите = номера на реда:
    for($j = 0; $j <= $i; $j++ ) {
        // Показваме по една звездичка за всяко завъртане на цикъла:
        echo "* ";
    }
    // Пренасяме всеки нов ред:
    echo "<br />";
}