<?php

// task5.php

// 5. Вложени цикли за извеждане на огледален триъгълник от * (звездички) :)

// Променлива за Максимален брой звезди на ред:
$maxstars = 5;

// Цикъл който създава редовете със звездички (*):
for ($i = 0; $i < $maxstars; $i++) {

    // Вътрешен for цикъл за брой звезди на ред, 
    // броя на звездите = номера на реда:
    for($j = 0; $j <= $i; $j++ ) {
        // Показваме по една звездичка за всяко завъртане на цикъла:
        echo "* ";
    }
    // Пренасяме всеки нов ред:
    echo "<br />";
}
// Започва цикъла от максималния бр. звезди на ред
for ($i = $maxstars; $i > 0; $i--) {

    // Намаляме с една звезда за всяко завъртане на цикъла
    for($j = $i; $j > 0; $j-- ) {
        echo "* ";
    }
    // Пренасяме всеки нов ред:
    echo "<br />";
}

